package lr1;

public class TaskInformation {
    public static void task_info() {
        System.out.println("Задание 1");
        System.out.println("Подготовьте текстовый файл записей для дальнейших исследований.");
        System.out.println("Размер файла должен быть достаточно большим (>>500Mb).");
        System.out.println("Формат данных произволен, но необходимо позаботиться о том,");
        System.out.println("чтоб в дальнейшем по этому файлу можно было вести поиск");
        System.out.println("и в случае необходимости добавлять новые записи.");
        System.out.println();
        System.out.println("Задание 2");
        System.out.println("Используя ваш тестовый файл, напишите программу для поиска данных на основе");
        System.out.println("самоорганизующегося файла. Предоставьте адекватный интерфейс для работы с");
        System.out.println("программой. (Д. Э. Кнут. Искусство программирования. Том 3 Сортировка и поиск.");
        System.out.println("Изд. Addison-Wesley, М.─2004 п. 6.1)");
        System.out.println();
        System.out.println("Задание 3");
        System.out.println("Напишите программу, которая переупорядочивает массив");
        System.out.println("целочисленных ключей согласно заданному распределению вероятностей.");
        System.out.println("Размер массива порядка 200-500 элементов.");
        System.out.println("Данный массив не содержит повторений.");
        System.out.println("В качестве примеров распределений возьмите:");
        System.out.println("геометрическое, биномиальное и клиновидное распределение");
        System.out.println("(P{X = Ki} = (N − i)C, где C — надлежащим образом выбранная константа).");
        System.out.println("Проведите эксперимент: организуйте порядка 10^5 запросов");
        System.out.println("поиска ключей с соответствующими распределениями.");
        System.out.println("Непосредственно подсчитайте среднее число операции сравнения.");
        System.out.println("Выполните подсчет в том случае, когда записи");
        System.out.println("не упорядочиваются по убыванию вероятностей запросов.");
        System.out.println("Согласуются ли полученные результаты с теоретическими?");
        System.out.println();
        System.out.println();
    }
}