package lr2;

public class TaskInformation {
    public static void task_info() {
        System.out.println("1. Наилучшее расположение записей в последовательной таблице определяется условием. А что собой представляет наихудшее расположение? Покажите, что имеется простое соотношение между средним количеством сравнений при наилучшем и наихудшем размещении записей.");
        System.out.println("2. Напишите моделирующую приложение для поиска на ленте с неравными записями, количество которых равно N > 10^3. Рассмотрите геометрическое, биномиальное и равномерные распределения. Выполните многократный поиск по вашей ленте и подсчитайте функцию стоимости для неупорядоченных записей и для упорядоченных.");
        System.out.println("3. Используйте (17) для вычисления среднего количества сравнений, необходимого для поиска в самоорганизующемся файле при бинарном распределении вероятностей ключей поиска. Далее напишите приложение, которое непосредственно вычисляет используемую вами сумму.");
        System.out.println("4. Используя (17), вычислите Сn для распределения вероятностей (6). Далее напишите приложение, которое непосредственно вычисляет используемую вами сумму.");
        System.out.println("5. Зачастую необходимо проверить, выполняются ли одновременно n заданных условий. (Например, может понадобиться проверить, что х>0 и у<х^2, и при этом не ясно, какое условие должно проверяться первым.) Предположим, что проверка j-го условия занимает Tj единиц времени и что условие выполняется с вероятностью pj (причем эта вероятность не зависит от результатов выполнения других условий). В каком порядке должны выполняться проверки?");

    }
}
