package lr2;

public class TaskInformation {
    public static void task_info() {
        System.out.println();
        System.out.println("Список заданий");
        System.out.println("Задание 1:");
        System.out.println("    Наилучшее расположение записей в последовательной таблице определяется условием. А что собой представляет наихудшее расположение? Покажите, что имеется простое соотношение между средним количеством сравнений при наилучшем и наихудшем размещении записей.");
        System.out.println("Задание 2:");
        System.out.println("    Напишите моделирующую приложение для поиска на ленте с неравными записями, количество которых равно N > 10^3. Рассмотрите геометрическое, биномиальное и равномерные распределения. Выполните многократный поиск по вашей ленте и подсчитайте функцию стоимости для неупорядоченных записей и для упорядоченных.");
        System.out.println("Задание 3:");
        System.out.println("    Используйте (17) для вычисления среднего количества сравнений, необходимого для поиска в самоорганизующемся файле при бинарном распределении вероятностей ключей поиска. Далее напишите приложение, которое непосредственно вычисляет используемую вами сумму.");
        System.out.println("Задание 4:");
        System.out.println("    Используя (17), вычислите Сn для распределения вероятностей (6). Далее напишите приложение, которое непосредственно вычисляет используемую вами сумму.");
        System.out.println("Задание 5:");
        System.out.println("    Зачастую необходимо проверить, выполняются ли одновременно n заданных условий.");
        System.out.println("    (Например, может понадобиться проверить, что х>0 и у<х^2, и при этом не ясно, какое условие должно проверяться первым.)");
        System.out.println("    Предположим, что проверка j-го условия занимает Tj единиц времени и что условие выполняется с вероятностью pj (причем эта вероятность не зависит от результатов выполнения других условий).");
        System.out.println("    В каком порядке должны выполняться проверки?");
        System.out.println();
    }
}
