package lr3;

public class TaskInformation {
    public static void task_info() {
        System.out.println();
        System.out.println("1. Прочитайте пункты 6.2.1 и 6.2.2. (Д. Э. Кнут. Искусство программирования. Том 3 Сортировка и поиск. Изд. Addison-Wesley, М.- 2004) (439 с.)");
        System.out.println("2. На основе вашего файла создайте бинарное дерево. Позаботьтесь о том, чтобы дерево получалось не вырожденным. Разработайте графическое приложение для представления этого дерева.");
        System.out.println("3. Для созданного вами дерева в задаче 2 реализуйте и продемонстрируйте алгоритмы T и D (поиска со вставкой и удаления соответственно).");

    }
}
